# # Parameters
# nc: 80 # number of classes
# scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
#   # [depth, width, max_channels]
#   s: [0.33, 0.50, 1024]

# backbone:
#   # [from, repeats, module, args]
#   - [-1, 1, Conv, [64, 3, 2]]        # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]]       # 1-P2/4
#   - [-1, 3, C2f, [128, True]]
#   - [-1, 1, Conv, [256, 3, 2]]       # 3-P3/8
#   - [-1, 6, C2f, [256, True]]
#   - [-1, 1, CBAM2, []]               # existing — good here
#   - [-1, 1, SimAM, []]               # ✅ ADD: zero-param, boosts P3 features
#   - [-1, 1, SCDown, [512, 3, 2]]     # P4/16
#   - [-1, 6, C2f, [512, True]]
#   - [-1, 1, ECA, [512]]              # ✅ ADD: lightweight channel attention P4
#   - [-1, 1, SCDown, [1024, 3, 2]]    # P5/32
#   - [-1, 3, C2fCIB, [1024, True, True]]
#   - [-1, 1, SPPF, [1024, 5]]
#   - [-1, 1, PSA, [1024]]

# # YOLOv8.0n head
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#   - [[-1, 6], 1, Concat, [1]] # cat backbone P4
#   - [-1, 3, C2f, [512]] # 13

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#   - [[-1, 4], 1, Concat, [1]] # cat backbone P3
#   - [-1, 3, C2f, [256]] # 16 (P3/8-small)

#   - [-1, 1, Conv, [256, 3, 2]]
#   - [[-1, 13], 1, Concat, [1]] # cat head P4
#   - [-1, 3, C2f, [512]] # 19 (P4/16-medium)

#   - [-1, 1, SCDown, [512, 3, 2]]
#   - [[-1, 10], 1, Concat, [1]] # cat head P5
#   - [-1, 3, C2fCIB, [1024, True, True]] # 22 (P5/32-large)

#   - [[16, 19, 22], 1, v10Detect, [nc]] # Detect(P3, P4, P5)



# Parameters
nc: 80
scales:
  s: [0.33, 0.50, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]               # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]              # 1-P2/4
  - [-1, 3, C2f, [128, True]]               # 2
  - [-1, 1, Conv, [256, 3, 2]]              # 3-P3/8
  - [-1, 6, C2f, [256, True]]               # 4
  - [-1, 1, CBAM2, []]                      # 5
  - [-1, 1, SimAM, []]                      # 6
  - [-1, 1, SCDown, [512, 3, 2]]            # 7-P4/16
  - [-1, 6, C2f, [512, True]]               # 8
  - [-1, 1, ECA, []]                        # 9
  - [-1, 1, SCDown, [1024, 3, 2]]           # 10-P5/32
  - [-1, 3, C2fCIB, [1024, True, True]]     # 11
  - [-1, 1, SPPF, [1024, 5]]               # 12
  - [-1, 1, PSA, [1024]]                    # 13

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 14
  - [[-1, 9], 1, Concat, [1]]                    # 15 - cat P4 (ECA output)
  - [-1, 3, C2f, [512]]                          # 16
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 17
  - [[-1, 6], 1, Concat, [1]]                    # 18 - cat P3 (SimAM output)
  - [-1, 3, C2f, [256]]                          # 19 (P3/8-small)
  - [-1, 1, Conv, [256, 3, 2]]                   # 20
  - [[-1, 16], 1, Concat, [1]]                   # 21 - cat head P4
  - [-1, 3, C2f, [512]]                          # 22 (P4/16-medium)
  - [-1, 1, SCDown, [512, 3, 2]]                 # 23
  - [[-1, 13], 1, Concat, [1]]                   # 24 - cat head P5 (PSA)
  - [-1, 3, C2fCIB, [1024, True, True]]          # 25 (P5/32-large)
  - [[19, 22, 25], 1, v10Detect, [nc]]           # 26
