# YOLOv10s with ConvNeXtBackbone
nc: 80

scales:
  s: [0.33, 0.50, 1024]

backbone:
  - [-1, 1, ConvNeXtBackbone, [True]]   # 0 — runs backbone, outputs list [192ch, 384ch, 768ch]
  - [0,  1, Index, [0]]                 # 1 — p3: 192ch @ stride 8
  - [0,  1, Index, [1]]                 # 2 — p4: 384ch @ stride 16
  - [0,  1, Index, [2]]                 # 3 — p5: 768ch @ stride 32

head:
  # ---------- Neck (PAN) ----------
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 4 — upsample p5
  - [[-1, 2], 1, Concat, [1]]                     # 5 — concat with p4 → 768+384=1152ch
  - [-1, 3, C2f, [384]]                           # 6

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 7 — upsample
  - [[-1, 1], 1, Concat, [1]]                     # 8 — concat with p3 → 384+192=576ch
  - [-1, 3, C2f, [192]]                           # 9  ← P3 output

  - [-1, 1, Conv, [192, 3, 2]]                    # 10 — downsample
  - [[-1, 6], 1, Concat, [1]]                     # 11 — concat
  - [-1, 3, C2f, [384]]                           # 12 ← P4 output

  - [-1, 1, Conv, [384, 3, 2]]                    # 13 — downsample
  - [[-1, 3], 1, Concat, [1]]                     # 14 — concat with p5
  - [-1, 3, C2f, [768]]                           # 15 ← P5 output

  # ---------- Detection Head ----------
  - [[9, 12, 15], 1, v10Detect, [nc]]             # 16 — detect on P3/P4/P5
