# Ultralytics AGPL-3.0 License
# YOLOv10s — Unified MSCA+CBAM2 for SIPaKMeD cervical cell classification
# Architecture decisions:
#   - MSCA at P4/P5 backbone exits (multi-scale context > ECA for morphology)
#   - CBAM2 in neck FPN after each C2f (spatial+channel, one per level)
#   - SimAM REMOVED from neck (was causing gradient interference / no gain)
#   - PSA retained at top of backbone (global context before FPN)
#   - v10Detect head: P3/P4/P5 with [128, 256, 512] channels

nc: 5  # SIPaKMeD: Superficial, Intermediate, Dyskeratotic, Koilocytotic, Parabasal

scales:
  # [depth, width, max_channels]
  s: [0.33, 0.50, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,    [64, 3, 2]]            # 0 - P1/2
  - [-1, 1, Conv,    [128, 3, 2]]           # 1 - P2/4
  - [-1, 3, C2f,    [128, True]]            # 2
  - [-1, 1, Conv,    [256, 3, 2]]           # 3 - P3/8
  - [-1, 6, C2f,    [256, True]]            # 4 - P3 features (skip to neck)
  - [-1, 1, SCDown,  [512, 3, 2]]           # 5 - P4/16
  - [-1, 6, C2f,    [512, True]]            # 6
  - [-1, 1, MSCA,   [512]]                  # 7 - Multi-Scale Context Attention @ P4
  - [-1, 1, SCDown,  [1024, 3, 2]]          # 8 - P5/32
  - [-1, 3, C2fCIB, [1024, True, True]]     # 9
  - [-1, 1, MSCA,   [1024]]                 # 10 - Multi-Scale Context Attention @ P5
  - [-1, 1, SPPF,   [1024, 5]]             # 11
  - [-1, 1, PSA,    [1024]]                 # 12 - Global context (keep)

head:
  # ── Top-down FPN ──────────────────────────────────────
  - [-1,    1, nn.Upsample, [None, 2, "nearest"]]   # 13
  - [[-1, 7], 1, Concat,    [1]]                    # 14 - cat backbone P4 (after MSCA)
  - [-1,    1, C2f,         [512, 1]]               # 15 - P4 neck features
  - [-1,    1, CBAM2,       [256]]                  # 16 - CBAM2 on P4 neck ← key attention

  - [-1,    1, nn.Upsample, [None, 2, "nearest"]]   # 17
  - [[-1, 4], 1, Concat,    [1]]                    # 18 - cat backbone P3
  - [-1,    1, C2f,         [256, 1]]               # 19 - P3 neck features
  - [-1,    1, CBAM2,       [128]]                  # 20 - CBAM2 on P3 neck ← key attention

  # ── Bottom-up PAN ──────────────────────────────────────
  - [-1,    1, Conv,         [256, 3, 2]]           # 21 - downsample P3→P4
  - [[-1, 15], 1, Concat,   [1]]                    # 22 - cat head P4
  - [-1,    1, C2f,         [512, 1]]               # 23 - P4 out

  - [-1,    1, SCDown,      [512, 3, 2]]            # 24 - downsample P4→P5
  - [[-1, 12], 1, Concat,   [1]]                    # 25 - cat head P5 (after PSA)
  - [-1,    1, C2fCIB,      [1024, True, True]]     # 26 - P5 out

  # ── Detection ──────────────────────────────────────────
  - [[20, 23, 26], 1, v10Detect, [nc, [128, 256, 512]]]  # 27 - P3/P4/P5


# ── Recommended training config ────────────────────────
# optimizer: AdamW
# lr0: 0.0005
# cos_lr: True
# warmup_epochs: 3
# epochs: 300
# close_mosaic: 50        ← was 20, extend mosaic for harder augmentation
# label_smoothing: 0.15   ← slight increase for boundary classes
#
# Loss weights (MOST IMPORTANT lever):
# cls: 3.0    ← push harder on Dyskeratotic/Koilocytotic separation
# box: 1.5
# dfl: 1.0
#
# Augmentation additions:
# hsv_h: 0.02
# hsv_s: 0.8
# hsv_v: 0.5
# copy_paste: 0.3   ← paste minority class instances
# mixup: 0.15       ← soft label mixing for boundary classes
